
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Introduction · 前端入门宝典-心法篇</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Laughing小石头">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-extra-html/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="pages/00-前置知识/" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">Pages</li>
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="pages/00-前置知识/">
            
                <a href="pages/00-前置知识/">
            
                    
                    前置知识
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="pages/00-前置知识/01-GIT的安装使用.html">
            
                <a href="pages/00-前置知识/01-GIT的安装使用.html">
            
                    
                    GIT的安装使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="pages/00-前置知识/02-Nodejs环境安装.html">
            
                <a href="pages/00-前置知识/02-Nodejs环境安装.html">
            
                    
                    Nodejs环境安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="pages/00-前置知识/03-Gitbook的使用.html">
            
                <a href="pages/00-前置知识/03-Gitbook的使用.html">
            
                    
                    Gitbook的使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="pages/00-前置知识/04-Markdown文档语法.html">
            
                <a href="pages/00-前置知识/04-Markdown文档语法.html">
            
                    
                    Markdown文档语法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="pages/00-前置知识/05-VSCODE的安装及插件.html">
            
                <a href="pages/00-前置知识/05-VSCODE的安装及插件.html">
            
                    
                    VSCODE的安装及插件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="pages/00-前置知识/06-迅睿CMS系统学习文档.html">
            
                <a href="pages/00-前置知识/06-迅睿CMS系统学习文档.html">
            
                    
                    迅睿CMS系统学习文档
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" >
            
                <span>
            
                    
                    Images
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="pages/01-第一章 认识前端/">
            
                <a href="pages/01-第一章 认识前端/">
            
                    
                    第一章 认识前端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="pages/02-第二章 HTML基础/">
            
                <a href="pages/02-第二章 HTML基础/">
            
                    
                    第二章 HTML基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="pages/03-第三章 CSS基础/">
            
                <a href="pages/03-第三章 CSS基础/">
            
                    
                    第三章 CSS基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="pages/04-第四章 JAVASCRIPT基础/">
            
                <a href="pages/04-第四章 JAVASCRIPT基础/">
            
                    
                    第四章 JAVASCRIPT基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="pages/05-第五章 认识DOM/">
            
                <a href="pages/05-第五章 认识DOM/">
            
                    
                    第五章 认识DOM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="pages/06-第六章 认识BOM/">
            
                <a href="pages/06-第六章 认识BOM/">
            
                    
                    第六章 认识BOM
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="pages/07-第七章 面向对象/">
            
                <a href="pages/07-第七章 面向对象/">
            
                    
                    第七章 面向对象
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Introduction</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <header></header><h1 id="&#x524D;&#x7AEF;&#x5165;&#x95E8;&#x5B9D;&#x5178;-&#x5FC3;&#x6CD5;&#x7BC7;">&#x524D;&#x7AEF;&#x5165;&#x95E8;&#x5B9D;&#x5178;-&#x5FC3;&#x6CD5;&#x7BC7;</h1>
<blockquote>
<p>&#x2003;&#x2003;&#x672C;&#x6587;&#x6863;&#x662F;&#x6211;&#x5728;B&#x7AD9;&#x53D1;&#x5E03;&#x7684;&#x524D;&#x7AEF;&#x5165;&#x95E8;&#x7CFB;&#x5217;&#x7ECF;&#x9A8C;&#x5206;&#x4EAB;&#x4E4B;&#x5FC3;&#x6CD5;&#x7BC7;&#x7684;&#x914D;&#x5957;&#x6587;&#x6863;&#xFF0C;&#x4F5C;&#x4E3A;&#x524D;&#x7AEF;&#x5165;&#x95E8;&#x7CFB;&#x5217;&#x7684;&#x5206;&#x4EAB;&#x8BFE;&#x7A0B;&#xFF0C;&#x672C;&#x8BFE;&#x7A0B;&#x6DB5;&#x76D6;&#x4E86;HTML&#x548C;CSS&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x6807;&#x7B7E;&#x548C;&#x5C5E;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;JAVASCRIPT&#x4E2D;&#x4E3B;&#x8981;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x53E6;&#x5916;&#x8BFE;&#x7A0B;&#x4E2D;&#x8FD8;&#x4F1A;&#x5BF9;&#x4E0E;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x9762;&#x8BD5;&#x9898;&#x8FDB;&#x884C;&#x5217;&#x4E3E;&#x53CA;&#x8BB2;&#x89E3;&#xFF0C;&#x5E0C;&#x671B;&#x5BF9;&#x60F3;&#x8981;&#x8F6C;&#x884C;&#x524D;&#x7AEF;&#x7684;&#x540C;&#x5B66;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x6700;&#x540E;&#x9001;&#x5927;&#x5BB6;&#x4E00;&#x53E5;&#x8BDD;&#x2014;&#x2014;&#x5BF9;&#x592F;&#x5B9E;&#x57FA;&#x7840;&#x7EC3;&#x5185;&#x529F;&#xFF0C;&#x65E5;&#x540E;&#x6C5F;&#x6E56;&#x5FC5;&#x6210;&#x529F;&#x3002;</p>
</blockquote>
<h3 id="&#x4E3A;&#x4EC0;&#x4E48;&#x60F3;&#x8981;&#x51FA;&#x8FD9;&#x5957;&#x7CFB;&#x5217;&#x8BFE;&#x7A0B;">&#x4E3A;&#x4EC0;&#x4E48;&#x60F3;&#x8981;&#x51FA;&#x8FD9;&#x5957;&#x7CFB;&#x5217;&#x8BFE;&#x7A0B;</h3>
<p>&#x2003;&#x2003;&#x5176;&#x5B9E;&#x4E0E;&#x5176;&#x8BF4;&#x8FD9;&#x662F;&#x4E00;&#x5957;&#x8BFE;&#x7A0B;&#xFF0C;&#x6211;&#x66F4;&#x613F;&#x610F;&#x5C06;&#x5B83;&#x5F53;&#x4F5C;&#x662F;&#x6211;&#x5BF9;&#x8FD9;6&#x5E74;&#x524D;&#x7AEF;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x7684;&#x4E00;&#x6B21;&#x81EA;&#x6211;&#x7684;&#x56DE;&#x987E;&#x3002;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x521A;&#x8FC7;&#x5B8C;&#x800C;&#x7ACB;&#x4E4B;&#x5E74;&#x7684;&#x751F;&#x65E5;&#xFF0C;&#x56DE;&#x9996;&#x8FC7;&#x5F80;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#xFF0C;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x9664;&#x4E86;&#x65E5;&#x6E10;&#x5706;&#x6EDA;&#x7684;&#x809A;&#x8169;&#x548C;&#x53EF;&#x4EE5;&#x5AB2;&#x7F8E;&#x5367;&#x8695;&#x7684;&#x9ED1;&#x773C;&#x5708;&#xFF0C;&#x597D;&#x50CF;&#x4E5F;&#x6CA1;&#x5176;&#x4ED6;&#x4EC0;&#x4E48;&#x4E86;&#xFF0C;&#x4E0D;&#x7ECF;&#x6709;&#x4E9B;&#x8FF7;&#x60D8;&#xFF0C;&#x54E6;&#xFF0C;&#x4E0D;&#x5BF9;&#x4E0D;&#x5BF9;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#xFF0C;&#x8FD9;&#x4E0D;&#x786C;&#x76D8;&#x5907;&#x4EFD;&#x7684;&#x8D44;&#x6599;&#x5DF2;&#x7ECF;&#x597D;&#x51E0;&#x4E2A;T&#x7684;&#x5C0F;&#x59D0;&#x59D0;&#x4E86;&#xB7;&#xB7;&#xB7;&#x54C8;&#x54C8;&#x5F00;&#x4E2A;&#x73A9;&#x7B11;&#xFF0C;&#x5185;&#x5BB9;&#x8DD1;&#x504F;&#x4E86;&#xFF0C;&#x8BF4;&#x56DE;&#x6B63;&#x9898;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x6B21;&#x5951;&#x673A;&#xFF0C;&#x8981;&#x7ED9;&#x4E00;&#x4E2A;&#x521A;&#x6BD5;&#x4E1A;&#x96F6;&#x57FA;&#x7840;&#x7684;&#x540C;&#x5B66;&#x505A;&#x524D;&#x7AEF;&#x57F9;&#x8BAD;&#xFF0C;&#x8BA9;&#x6211;&#x840C;&#x751F;&#x4E86;&#x505A;&#x89C6;&#x9891;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x628A;&#x57F9;&#x8BAD;&#x8BFE;&#x7A0B;&#x5F55;&#x5236;&#x6210;&#x89C6;&#x9891;&#xFF0C;&#x8BA9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x770B;&#x5230;&#xFF0C;&#x7528;&#x6211;&#x6240;&#x957F;&#x6765;&#x5E2E;&#x52A9;&#x66F4;&#x591A;&#x60F3;&#x8981;&#x5165;&#x95E8;&#x524D;&#x7AEF;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x5E2E;&#x52A9;&#x4ED6;&#x4EEC;&#x5F00;&#x542F;&#x524D;&#x7AEF;&#x7684;&#x5927;&#x95E8;&#x3002;</p>
<p>&#x2003;&#x2003;&#x8FD9;&#x65F6;&#x5019;&#x4E5F;&#x8BB8;&#x6709;&#x4EBA;&#x4F1A;&#x95EE;&#xFF0C;&#x76EE;&#x524D;&#x5E02;&#x9762;&#x4E0A;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x8BFE;&#x7A0B;&#x5F88;&#x591A;&#xFF0C;&#x4ED8;&#x8D39;&#x7684;&#x514D;&#x8D39;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x90FD;&#x662F;&#x540D;&#x5E08;&#x6216;&#x8005;BAT&#x5927;&#x5382;&#x5927;&#x725B;&#x5E26;&#x7740;&#x4F60;&#x73A9;&#x8F6C;&#x524D;&#x7AEF;&#xFF0C;&#x518D;&#x51FA;&#x8FD9;&#x6837;&#x540C;&#x8D28;&#x5316;&#x89C6;&#x9891;&#x4E0D;&#x662F;&#x591A;&#x6B64;&#x4E00;&#x4E3E;&#x561B;&#xFF0C;&#x76F4;&#x63A5;&#x627E;&#x5957;&#x597D;&#x7684;&#x8BFE;&#x7A0B;&#x4E0D;&#x5C31;&#x5B8C;&#x4E8B;&#x4E86;&#xFF0C;&#x96BE;&#x9053;&#x4F60;&#x6BD4;&#x4EBA;&#x5BB6;&#x540D;&#x5E08;&#x548C;&#x5927;&#x725B;&#x66F4;&#x5389;&#x5BB3;&#xFF0C;&#x6559;&#x5B66;&#x7ECF;&#x9A8C;&#x66F4;&#x4E30;&#x5BCC;&#xFF1F;&#x786E;&#x5B9E;&#x76EE;&#x524D;&#x5DF2;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x4F18;&#x79C0;&#x7684;&#x540C;&#x7C7B;&#x578B;&#x8BFE;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x90FD;&#x662F;&#x591A;&#x5E74;&#x6559;&#x5B66;&#x7ECF;&#x9A8C;&#x7684;&#x8BB2;&#x5E08;&#x6216;&#x8005;BAT&#x5927;&#x5382;&#x7684;&#x5927;&#x725B;&#x4EB2;&#x81EA;&#x6307;&#x5BFC;&#x6388;&#x8BFE;&#xFF0C;&#x8FD9;&#x70B9;&#x6211;&#x627F;&#x8BA4;&#x786E;&#x5B9E;&#x6BD4;&#x4E0D;&#x4E0A;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8FD8;&#x662F;&#x8981;&#x505A;&#x5462;&#xFF0C;&#x5176;&#x5B9E;&#x4E3B;&#x8981;&#x662F;&#x57FA;&#x4E8E;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#x539F;&#x56E0;&#xFF0C;&#x4E14;&#x542C;&#x6211;&#x6162;&#x6162;&#x9053;&#x6765;&#xFF1A;</p>
<ol>
<li>&#x57F9;&#x8BAD;&#x7684;&#x672C;&#x8D28;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4F20;&#x9053;&#x53D7;&#x4E1A;&#x89E3;&#x60D1;&#xFF0C;&#x4F20;&#x7684;&#x7684;&#x662F;&#x524D;&#x7AEF;&#x77E5;&#x8BC6;&#xFF0C;&#x53D7;&#x7684;&#x662F;&#x8BB2;&#x5E08;&#x771F;&#x5B9E;&#x7684;&#x804C;&#x4E1A;&#x7ECF;&#x5386;&#xFF0C;&#x89E3;&#x7684;&#x662F;&#x5B66;&#x5458;&#x81EA;&#x8EAB;&#x7684;&#x8FF7;&#x832B;&#x548C;&#x7591;&#x60D1;&#xFF0C;&#x6240;&#x4F20;&#x6388;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x8BB2;&#x5E08;&#x81EA;&#x8EAB;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x522B;&#x4EBA;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x62FF;&#x522B;&#x4EBA;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F20;&#x522B;&#x4EBA;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#x4E5F;&#x4F20;&#x4E0D;&#x597D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x5BF9;&#x5B66;&#x5458;&#x7684;&#x4E0D;&#x8D1F;&#x8D23;&#x4EFB;&#x3002;</li>
<li>&#x6B63;&#x662F;&#x7531;&#x4E8E;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x8BFE;&#x7A0B;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x5373;&#x4FBF;&#x6211;&#x4EEC;&#x8981;&#x7528;&#xFF0C;&#x90A3;&#x600E;&#x4E48;&#x9009;&#x62E9;&#x662F;&#x4E2A;&#x96BE;&#x9898;&#xFF0C;&#x90FD;&#x662F;&#x8D44;&#x6DF1;&#x524D;&#x8F88;&#xFF0C;&#x600E;&#x4E48;&#x5224;&#x65AD;&#x8C01;&#x597D;&#x8C01;&#x574F;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BB2;&#x5E08;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x53D7;&#x4F17;&#x7FA4;&#x4F53;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x4E00;&#x4E2A;&#x96BE;&#x4EE5;&#x6289;&#x62E9;&#x7684;&#x4E8B;&#x60C5;&#x3002;</li>
<li>&#x6700;&#x540E;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x60F3;&#x7ED9;&#x81EA;&#x5DF1;&#x800C;&#x7ACB;&#x4E4B;&#x524D;&#x7684;&#x4EBA;&#x751F;&#x9053;&#x8DEF;&#x7559;&#x4E0B;&#x70B9;&#x503C;&#x5F97;&#x56DE;&#x5FC6;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x5927;&#x5BB6;&#x6709;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x7ECF;&#x5E38;&#x60F3;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x53EF;&#x662F;&#x7531;&#x4E8E;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x8FDF;&#x8FDF;&#x6CA1;&#x6709;&#x53BB;&#x505A;&#xFF0C;&#x6700;&#x540E;&#x5C31;&#x4E0D;&#x4E86;&#x4E86;&#x4E4B;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x6709;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x5C31;&#x7ACB;&#x9A6C;&#x53BB;&#x505A;&#xFF0C;&#x4E0D;&#x8981;&#x60F3;&#x592A;&#x591A;&#xFF0C;&#x53EA;&#x6709;&#x505A;&#x51FA;&#x6765;&#x624D;&#x77E5;&#x9053;&#x597D;&#x574F;&#xFF0C;&#x53EA;&#x6709;&#x505A;&#x51FA;&#x6765;&#x624D;&#x4F1A;&#x6709;&#x6210;&#x957F;&#x3002;</li>
</ol>
<h3 id="&#x8BFE;&#x7A0B;&#x7684;&#x89C4;&#x5212;">&#x8BFE;&#x7A0B;&#x7684;&#x89C4;&#x5212;</h3>
<p>&#x5173;&#x4E8E;&#x524D;&#x7AEF;&#x5185;&#x5BB9;&#x7684;&#x5206;&#x4EAB;&#x6211;&#x89C4;&#x5212;&#x4E86;&#x4E09;&#x671F;&#xFF1A;<br></p>
<ul>
<li>&#x7B2C;&#x4E00;&#x671F;&#xFF1A;&#x524D;&#x7AEF;&#x5165;&#x95E8;&#x5B9D;&#x5178;-&#x5FC3;&#x6CD5;&#x7BC7;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5927;&#x5BB6;&#x73B0;&#x5728;&#x770B;&#x5230;&#x7684;&#x8FD9;&#x90E8;&#x5206;&#xFF0C;&#x559C;&#x6B22;&#x6B66;&#x4FA0;&#x5C0F;&#x8BF4;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x5BF9;&#x4E8E;&#x8D8A;&#x5389;&#x5BB3;&#x7684;&#x6B66;&#x529F;&#xFF0C;&#x5FC3;&#x6CD5;&#x5C31;&#x8D8A;&#x91CD;&#x8981;&#xFF0C;&#x5FC3;&#x6CD5;&#x662F;&#x6B66;&#x529F;&#x7684;&#x6839;&#xFF0C;&#x5373;&#x4FBF;&#x4F60;&#x4F1A;&#x62DB;&#x5F0F;&#xFF0C;&#x4E0D;&#x4F1A;&#x5FC3;&#x6CD5;&#x4E5F;&#x65E0;&#x6CD5;&#x53D1;&#x6325;&#x51FA;&#x6B66;&#x529F;&#x7684;&#x5A01;&#x529B;&#xFF0C;&#x5BF9;&#x4E8E;&#x524D;&#x7AEF;&#x5B66;&#x4E60;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x524D;&#x7AEF;&#x4E09;&#x4EF6;&#x5957;&#xFF1A;HTML&#x3001;CSS&#x4EE5;&#x53CA;JAVASCRIPT&#xFF0C;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x524D;&#x7AEF;&#x7684;&#x5FC3;&#x6CD5;&#xFF0C;&#x524D;&#x7AEF;&#x8FD9;&#x4E9B;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#x65E5;&#x65B0;&#x6708;&#x5F02;&#xFF0C;&#x77E5;&#x8BC6;&#x7684;&#x66F4;&#x65B0;&#x8FED;&#x4EE3;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x5B66;&#x4F1A;&#x4E86;&#x57FA;&#x7840;&#xFF0C;&#x5E76;&#x4E14;&#x638C;&#x63E1;&#x624E;&#x5B9E;&#x4E86;&#xFF0C;&#x65E0;&#x8BBA;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x65B0;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x6280;&#x672F;&#x4F60;&#x90FD;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5B66;&#x4F1A;&#xFF0C;&#x4E07;&#x53D8;&#x4E0D;&#x79BB;&#x5176;&#x5B97;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x5B66;&#x4E60;&#x4E0D;&#x4EC5;&#x662F;&#x5B66;&#x4E60;&#x65B0;&#x77E5;&#x8BC6;&#x65B0;&#x6280;&#x80FD;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5B66;&#x4E60;&#x5F00;&#x53D1;&#x601D;&#x60F3;&#xFF0C;&#x8FD9;&#x4E2A;&#x624D;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x8981;&#x77E5;&#x5176;&#x7136;&#x66F4;&#x8981;&#x77E5;&#x5176;&#x6240;&#x4EE5;&#x7136;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x671F;&#xFF1A;&#x524D;&#x7AEF;&#x5165;&#x95E8;&#x5B9D;&#x5178;-&#x8FDB;&#x9636;&#x7BC7;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4F1A;&#x8BB2;&#x5230;HTML5&#x3001;CSS3&#x4EE5;&#x53CA;ES6&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x7684;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x548C;&#x7279;&#x6027;&#xFF0C;&#x5982;&#x4F55;&#x5229;&#x7528;&#x7B97;&#x6CD5;&#x5904;&#x7406;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8BF4;&#x5230;&#x7B97;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#x521D;&#x5B66;&#x8005;&#x4F1A;&#x89C9;&#x5F97;&#x7B97;&#x6CD5;&#x90A3;&#x662F;&#x540E;&#x7AEF;&#x7684;&#x4E8B;&#xFF0C;&#x548C;&#x524D;&#x7AEF;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x524D;&#x7AEF;&#x4E0D;&#x5C31;&#x662F;&#x753B;&#x753B;&#x9875;&#x9762;&#xFF0C;&#x83B7;&#x53D6;&#x4E0B;&#x6570;&#x636E;&#xFF0C;&#x5C55;&#x793A;&#x4E0B;&#x6570;&#x636E;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x7B97;&#x6CD5;&#xFF0C;&#x7528;&#x767E;&#x5EA6;&#x767E;&#x79D1;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x7B97;&#x6CD5;&#x5C31;&#x662F;&#x89E3;&#x9898;&#x65B9;&#x6848;&#x7684;&#x51C6;&#x786E;&#x800C;&#x5B8C;&#x6574;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x4E3E;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x5982;&#x4F55;&#x83B7;&#x53D6;a&#x5230;b&#x533A;&#x95F4;&#x7684;&#x968F;&#x673A;&#x6574;&#x6570;&#xFF1F;&#x4F30;&#x8BA1;&#x5F88;&#x591A;&#x6709;&#x70B9;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x5B66;&#x90FD;&#x4F1A;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#xFF1A;Math.floor(Math.random()*(b-a+1)+a)&#xFF0C;&#x7ED3;&#x5408;&#x767E;&#x5EA6;&#x767E;&#x79D1;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x5DE5;&#x4F5C;&#x4E2D;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x96BE;&#x9053;&#x4F60;&#x8981;&#x548C;&#x540E;&#x7AEF;&#x8BF4;&#xFF1A;&#x563F;&#x8001;&#x94C1;&#xFF0C;&#x7ED9;&#x4E2A;&#x63A5;&#x53E3;&#x6211;&#x53D6;&#x4E2A;&#x968F;&#x673A;&#x6570;&#xFF1F;&#x1F644;&#x4F30;&#x8BA1;&#x4F1A;&#x88AB;&#x540E;&#x7AEF;&#x7684;&#x767D;&#x773C;&#x7ED9;&#x76EF;&#x6B7B;</li>
<li>&#x7B2C;&#x4E09;&#x671F;&#xFF1A;&#x524D;&#x7AEF;&#x5165;&#x95E8;&#x5B9D;&#x5178;-&#x5229;&#x5203;&#x7BC7;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x4F1A;&#x8BB2;&#x5230;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7528;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x6846;&#x67B6;&#xFF0C;&#x6BD4;&#x5982;VUE&#xFF0C;VUE&#x7684;&#x4F7F;&#x7528;&#x4EE5;&#x53CA;&#x6211;&#x5BF9;VUE&#x5E95;&#x5C42;&#x7684;&#x4E1C;&#x897F;&#x7684;&#x4E00;&#x4E9B;&#x7406;&#x89E3;&#xFF0C;&#x6BD4;&#x5982;render&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x4F55;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;render&#x51FD;&#x6570;&#xFF0C;&#x4E0B;&#x9762;&#x5C31;&#x662F;&#x548C;VUE&#x98CE;&#x683C;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x7684;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x3001;UNIAPP&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x4EE5;&#x53CA;Element-UI&#x4E13;&#x6CE8;&#x4E8E;&#x540E;&#x53F0;&#x7684;UI&#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x4E0D;&#x662F;&#x8FD8;&#x6709;React&#xFF0C;React&#x6211;&#x5C31;&#x4E0D;&#x8BB2;&#x4E86;&#xFF0C;React&#x867D;&#x7136;&#x662F;&#x5F88;&#x4F18;&#x79C0;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x6CA1;&#x7528;&#x8FC7;&#x4E5F;&#x6CA1;&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x8FC7;&#x6CA1;&#x8D44;&#x683C;&#x8BB2;&#xFF0C;&#x4E5F;&#x8BB2;&#x4E0D;&#x4E86;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x8BEF;&#x4EBA;&#x5B50;&#x5F1F;&#x561B;&#x1F602;</li>
</ul>
<h3 id="&#x672C;&#x5957;&#x8BFE;&#x7A0B;&#x9002;&#x7528;&#x4EBA;&#x7FA4;">&#x672C;&#x5957;&#x8BFE;&#x7A0B;&#x9002;&#x7528;&#x4EBA;&#x7FA4;</h3>
<p>&#x2003;&#x2003;&#x9996;&#x5148;&#x5462;&#x5C31;&#x662F;&#x96F6;&#x57FA;&#x7840;&#x7684;&#x5C0F;&#x767D;&#x540C;&#x5B66;&#x5566;&#x3002;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x5B66;&#x663E;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x4EBA;&#x65E0;&#x5B8C;&#x4EBA;&#x603B;&#x4F1A;&#x6709;&#x70B9;&#x6B20;&#x7F3A;&#xFF0C;&#x5DEE;&#x7F3A;&#x8865;&#x6F0F;&#x4E0B;&#xFF0C;&#x5C31;&#x5F53;&#x6211;&#x5E2E;&#x4F60;&#x4EEC;&#x6574;&#x7406;&#x4E86;&#x4EFD;&#x6BD4;&#x8F83;&#x8BE6;&#x7EC6;&#x7684;&#x5B66;&#x4E60;&#x7B14;&#x8BB0;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x725B;&#x90A3;&#x80AF;&#x5B9A;&#x5C31;&#x4E0D;&#x7528;&#x770B;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x8FD8;&#x662F;&#x5E0C;&#x671B;&#x6709;&#x5927;&#x725B;&#x80FD;&#x591F;&#x770B;&#x5230;&#xFF0C;&#x80FD;&#x7ED9;&#x6211;&#x4E9B;&#x5B9D;&#x8D35;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x505A;&#x7684;&#x4E0D;&#x597D;&#x7684;&#x5730;&#x65B9;&#x8FD8;&#x8BF7;&#x4E0D;&#x541D;&#x8D50;&#x6559;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x6210;&#x957F;&#xFF0C;&#x54C8;&#x54C8;&#x1F61D;</p>
<h3 id="&#x5B66;&#x4E60;&#x5EFA;&#x8BAE;">&#x5B66;&#x4E60;&#x5EFA;&#x8BAE;</h3>
<p>&#x2003;&#x2003;&#x5BF9;&#x4E8E;&#x60F3;&#x8981;&#x5165;&#x95E8;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x6211;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#x6BCF;&#x5929;&#x81F3;&#x5C11;&#x8981;&#x62BD;&#x51FA;2-3&#x4E2A;&#x5C0F;&#x65F6;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x5B66;&#x4E60;&#x540E;&#x591A;&#x627E;&#x4E9B;&#x76F8;&#x5173;&#x7684;&#x9898;&#x76EE;&#x6765;&#x7EC3;&#x4E60;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x5EFA;&#x8BAE;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x7528;&#x6211;&#x7684;&#x8FD9;&#x4EFD;&#x7535;&#x5B50;&#x4E66;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6240;&#x5B66;&#x5185;&#x5BB9;&#x6574;&#x7406;&#x51FA;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x7B14;&#x8BB0;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x524D;&#x7F6E;&#x77E5;&#x8BC6;&#x91CC;&#x4F1A;&#x6709;&#x8BE6;&#x7EC6;&#x7684;&#x7B14;&#x8BB0;&#x521B;&#x5EFA;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x4E0D;&#x4F1A;&#x901A;&#x8FC7;&#x89C6;&#x9891;&#x5F62;&#x5F0F;&#x8BB2;&#x89E3;&#xFF0C;&#x5927;&#x5BB6;&#x5C31;&#x6309;&#x7167;&#x7B14;&#x8BB0;&#x91CC;&#x7684;&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;&#x81EA;&#x5DF1;&#x7814;&#x7A76;&#xFF0C;&#x6709;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4ED6;&#x76F8;&#x5173;&#x89C6;&#x9891;&#x7559;&#x8A00;&#x6216;&#x8005;&#x7ED9;&#x6211;&#x79C1;&#x4FE1;&#x3002;</p>
<h3 id="&#x8BFE;&#x7A0B;&#x66F4;&#x65B0;">&#x8BFE;&#x7A0B;&#x66F4;&#x65B0;</h3>
<p>&#x2003;&#x2003;&#x6211;&#x4F1A;&#x5C3D;&#x91CF;&#x62BD;&#x51FA;&#x65F6;&#x95F4;&#xFF0C;&#x4E89;&#x53D6;&#x6BCF;&#x5468;&#x51FA;&#x4E24;&#x5230;&#x4E09;&#x671F;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x554A;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x9879;&#x76EE;&#x6BD4;&#x8F83;&#x8D76;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x51FA;&#x89C6;&#x9891;&#x4E86;&#xFF0C;&#x8FD8;&#x8BF7;&#x5927;&#x5BB6;&#x80FD;&#x4EE5;&#x4E00;&#x9897;&#x5305;&#x5BB9;&#x7684;&#x5FC3;&#x8C05;&#x89E3;&#x6211;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;Laughing&#x5728;&#x6B64;&#x8C22;&#x8FC7;&#x4E86;&#x1F91D; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; web-develop-guide (2021 - present) all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">File Modify: 
2021-05-17 14:30:41
</span></footer><footer></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="pages/00-前置知识/" class="navigation navigation-next navigation-unique" aria-label="Next page: 前置知识">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Introduction","level":"1.1","depth":1,"next":{"title":"前置知识","level":"1.2","depth":1,"path":"pages/00-前置知识/README.md","ref":"pages/00-前置知识/README.md","articles":[{"title":"GIT的安装使用","level":"1.2.1","depth":2,"path":"pages/00-前置知识/01-GIT的安装使用.md","ref":"pages/00-前置知识/01-GIT的安装使用.md","articles":[]},{"title":"Nodejs环境安装","level":"1.2.2","depth":2,"path":"pages/00-前置知识/02-Nodejs环境安装.md","ref":"pages/00-前置知识/02-Nodejs环境安装.md","articles":[]},{"title":"Gitbook的使用","level":"1.2.3","depth":2,"path":"pages/00-前置知识/03-Gitbook的使用.md","ref":"pages/00-前置知识/03-Gitbook的使用.md","articles":[]},{"title":"Markdown文档语法","level":"1.2.4","depth":2,"path":"pages/00-前置知识/04-Markdown文档语法.md","ref":"pages/00-前置知识/04-Markdown文档语法.md","articles":[]},{"title":"VSCODE的安装及插件","level":"1.2.5","depth":2,"path":"pages/00-前置知识/05-VSCODE的安装及插件.md","ref":"pages/00-前置知识/05-VSCODE的安装及插件.md","articles":[]},{"title":"迅睿CMS系统学习文档","level":"1.2.6","depth":2,"path":"pages/00-前置知识/06-迅睿CMS系统学习文档.md","ref":"pages/00-前置知识/06-迅睿CMS系统学习文档.md","articles":[]},{"title":"Images","level":"1.2.7","depth":2,"ref":"","articles":[]}]},"dir":"ltr"},"config":{"plugins":["advanced-emoji","todo","chapter-fold","-lunr","-search","search-pro","github","splitter","tbfed-pagefooter","hide-element","summary","extra-html"],"root":"docs","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy web-develop-guide (2021 - present)"},"chapter-fold":{},"github":{"url":"https://github.com/gaoxiaoshi/web-develop-guide"},"todo":{},"summary":{},"splitter":{},"search-pro":{},"extra-html":{"footer":{},"header":{}},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"advanced-emoji":{"embedEmojis":false},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":true,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Laughing小石头","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"前端入门宝典-心法篇","language":"zh-hans","gitbook":"*","description":"夯实基础练内功，日后江湖必成功"},"file":{"path":"README.md","mtime":"2021-05-17T06:30:41.950Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-19T00:59:20.030Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-extra-html/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

